In [1]:
import requests
import pandas as pd

In [2]:
data= requests.get('https://data.snb.ch/api/cube/snbbipo/data/csv/en').text

In [3]:
type(data)

str

In [4]:
dataList=data.splitlines()
type(data)

str

In [5]:
dataList[:11]

['"CubeId";"snbbipo"',
 '"PublishingDate";"2023-05-31 09:00"',
 '',
 '"Date";"D0";"Value"',
 '"1996-12";"GFG";"11903.9"',
 '"1996-12";"D";"49328.4"',
 '"1996-12";"RIWF";"2067.8"',
 '"1996-12";"IZ";"290"',
 '"1996-12";"W";"204.3"',
 '"1996-12";"FRGSF";',
 '"1996-12";"FRGUSD";']

In [6]:
# remove the first 4 rows as these are unnecessary data
dataList=dataList[4:]
dataList[:5]

['"1996-12";"GFG";"11903.9"',
 '"1996-12";"D";"49328.4"',
 '"1996-12";"RIWF";"2067.8"',
 '"1996-12";"IZ";"290"',
 '"1996-12";"W";"204.3"']

In [7]:
# replace double quot with none
dataList = list(map(lambda x : x.replace('"','').split(';'),dataList))
dataList[1:5]

[['1996-12', 'D', '49328.4'],
 ['1996-12', 'RIWF', '2067.8'],
 ['1996-12', 'IZ', '290'],
 ['1996-12', 'W', '204.3']]

In [8]:
type(dataList)

list

In [9]:
len(dataList)

8876

In [10]:
# remove first 4 items from a list
dataList=dataList[4:]

In [11]:
len(dataList)

8872

In [12]:
dataList[1:5]

[['1996-12', 'FRGSF', ''],
 ['1996-12', 'FRGUSD', ''],
 ['1996-12', 'GSGSF', ''],
 ['1996-12', 'IG', '1581.7']]

## creating DataFrame using this List of lists

In [13]:
columns = ['Year-Month','Name','value']

df=pd.DataFrame(dataList,columns=columns)
df.shape

(8872, 3)

In [14]:
df['value'] = pd.to_numeric(df['value'])
df.head()

  Year-Month    Name   value
0    1996-12       W   204.3
1    1996-12   FRGSF     NaN
2    1996-12  FRGUSD     NaN
3    1996-12   GSGSF     NaN
4    1996-12      IG  1581.7

In [15]:
df.dtypes

Year-Month     object
Name           object
value         float64
dtype: object

In [16]:
df['value']=df['value'].fillna(0)
df.head()

  Year-Month    Name   value
0    1996-12       W   204.3
1    1996-12   FRGSF     0.0
2    1996-12  FRGUSD     0.0
3    1996-12   GSGSF     0.0
4    1996-12      IG  1581.7

In [17]:
df['value']=df['value'].round(decimals=2)
df.head()

  Year-Month    Name   value
0    1996-12       W   204.3
1    1996-12   FRGSF     0.0
2    1996-12  FRGUSD     0.0
3    1996-12   GSGSF     0.0
4    1996-12      IG  1581.7

In [18]:
df.tail()

     Year-Month   Name      value
8867    2023-04     VF   17813.86
8868    2023-04  AIWFS   10639.52
8869    2023-04     SP      89.39
8870    2023-04     RE   78510.18
8871    2023-04     T1  932483.63

#### End of this Notebook; 
Author: < Shafi Mohiddin Shaik><hr>
LinkedIn:[Click Here to Shafi's Linkedin Page](https://www.linkedin.com/in/shafi-shaik-0279651b0)